<a href="https://colab.research.google.com/github/moronii/PYTHON-COM-SQL/blob/main/C%C3%B3pia_de_moroni__python_sql.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Banco de Dados

* Componentes
  * Base de dados
  * Sistema Gerenciador de Bando de Dados (SGDB)
  * Linguagem de Manipulação
    *  Structered Query Language (SQL)
  * Programas adicionais

* Arquitetura
  * Cliente-Servidor

## Modelo Relacional
  
|fruta | calorias | proteinas | carboidratos|
|---- |----|-----|----|
|Banana| 40| 1| 7|
|Uva | 16| 2| 72|
|Ameixa| 43| 4| 12|

Tabela ou Relação

Linhas, Intâncias, Entradas, Registros, Tupla

Colunas, atributos, características

## Implementação em SQL

* dialetos: MySQL, PostreSQL, MariaDB, Oracle etc

* MySQL online: https://paiza.io/en/projects/new?language=mysql
* PostgreSQL as a Service: https://www.elephantsql.com/
* Sqlite e PostgreSQL: https://sqliteonline.com/

Soluções OpenSource
* MariaDB
* MySQL
* MongoDB
* PostgreSQL
* SQLite
* Firebird
* CUBRID

In [ ]:
print("Hello")
8+9

Hello

17

# Crie uma tebela de nome exercicio com quatro campos,
 * nome,
 * nota,
 * aula, 
 * id. 
* Insira três registros na tabela e mostre os dados inseridos.*

#### Criando um banco de dados dentro do SGDB
* MySQL
      CREATE DATABASE [IF NOT EXISTS] db_name
*PostgreSQL
      CREATE DATABASE name
*SQLite
      # Não tem (nesse formato)

### Linguagem de Descrição, Definição de Dados (DDL)
Create, Alter, Drop

* CREATE table tabela(
  id int(11) NOT NULL,
  nome VARChar(30) NOT NULL,
  idade INT(11) NOT NULL
)


* `ALTER TABLE primeiraTabela add COLUMN altura int(11);` 
* `alter table primeiraTabela drop COLUMN altura;`


#### CREATE (Criar)
      CREATE [TEMPORARY] TABLE [IF NOT EXISTS] tbl_name
      [column_name column_type column_constraint, ...]
      [table_constraints, ...]

[MySQL types](https://dev.mysql.com/doc/refman/8.0/en/data-types.html) 
\- [PostrgreSQL types](https://www.postgresql.org/docs/9.5/datatype.html)
\- [SQLite types](https://www.sqlite.org/datatype3.html)

* Most used Constraints:

#### ALTER (alterar)
      ALTER TABLE tbl_name [alter_option, ...]

#### DROP (descartar)
      DROP TABLE [ IF EXISTS ] tbl_name [, ...]

### Linguagem de Manipulação de Dados (DML)
* INSERT, UPDATE, DELETE
* INSERT INTO nome_tabela
(id, nome, idade) VALUES (1, "Danilo", 36)
* UPDATE tabela SET idade = "10" WHERE id = "3"
* DELETE FROM tabela WHERE id = "2"


#### INSERT (inserir)

      INSERT  INTO tbl_name[(col_name [, col_name] ...)]
      VALUES (value_list) [, (value_list)] ...```


#### UPDATE (atualizar)
      UPDATE table_reference
      SET assignment_list
      [WHERE where_condition]

#### DELETE (deletar) 
      DELETE FROM tbl_name [WHERE where_condition]

### Linguagem de Consulta de Dados (DQL)


#### SELECT (SELECIONAR)

      SELECT [ALL | ISTINCT | DISTINCTROW ]
      select_expr [, select_expr] ...
      [FROM table_references
      [WHERE where_condition]
      [GROUP BY {col_name | expr | position}, ...]
      [HAVING where_condition]
      [ORDER BY {col_name | expr | position} [ASC | DESC], ...]
      [LIMIT {[offset,] row_count | row_count OFFSET offset}]

#### JOINS

### Linguagem de Transação de Dados (DTL), 
Comandos
* BEGIN, 
* COMMIT, 
* ROLLBACK
---


### Linguagem de Controle de Dados (DCL), 
Comandos
* GRANT, 
* REVOKE

# Integração com Python

In [ ]:
! pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 1.7 MB/s
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [2]:
import sqlite3 #importando as bibliotecas de recurso sql
#import psycopg2
#import pymsql

In [5]:
#con = sqlite3.connect("banco_db")
con = sqlite3.connect("banco1")
#con = pymysql.connect()


  
|fruta | calorias | proteinas | carboidratos|
|---- |----|-----|----|
|Banana| 40| 1| 7|
|Uva | 16| 2| 72|
|Ameixa| 43| 4| 12|

In [6]:
#con.execute("""CREATE TABLE Fruta(
  #id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
  #nome_fruta VARCHAR(20),
  #calorias varchar(20),
  #proteinas varchar(20),
  #carboidratos varchar(20)
  #)""")

  con.execute("create table Legume ")

In [9]:
#nome_pokemon = "Charmander"

con.execute("""INSERT INTO Fruta(nome_fruta,calorias,proteinas,carboidratos) VALUES ('Banana', 40, 1, 7)""")

con.execute("""INSERT INTO Fruta(nome_fruta,calorias,proteinas,carboidratos) 
VALUES ('Uva', 16, 2, 72), ('ameixa', 43, 4, 12)""")

In [20]:
con.commit()

#comando select buscar os dados da tabela frutas

In [10]:
rs = con.execute("SELECT * FROM Fruta")

In [11]:
list(rs)

[(1, 'Banana', '40', '1', '7'),
 (2, 'Uva', '16', '2', '72'),
 (3, 'ameixa', '43', '4', '12')]

## SQLAlchemy

É um *framework* desenvolvido para permitir programar aplicações que usem Banco de dados, de maneira inpedepende e com diferentes tipos de abstração:

* Raw SQL (SQL Bruto)
* SQL Expression Language (Linguagem de Expressão SQL)
* Object-Relational Mapping - ORM (Mapeamento Objeto-Relacional)

### Raw SQL

In [22]:
from sqlalchemy import create_engine
from sqlalchemy.sql import text

In [23]:
# Cria a engine para o banco de dados

eng = create_engine("sqlite:///cars.db")
#eng_postgres = create_engine("postgresql://joomtyly:as6LBeTxT-9VwhLLHKaLLonMYDTqNLGz@raja.db.elephantsql.com/joomtyly")

In [24]:
# abre uma conexão com o banco e executa código SQL
with eng.connect() as con:
  con.execute(text('DROP TABLE IF EXISTS Cars'))
  con.execute(text('''CREATE TABLE Cars(Id INTEGER PRIMARY KEY, 
                   Name TEXT, Price INTEGER)'''))

In [25]:
#inserir dados na tabela
with eng.connect() as con:
  con.execute(text("INSERT INTO Cars(Id, Name, Price) VALUES (10, 'belina', 1500)"))

In [26]:
data = [{ "Id": 1, "Name": "Audi", "Price": 52642 },
        { "Id": 2, "Name": "Mercedes", "Price": 57127 },
        { "Id": 3, "Name": "Skoda", "Price": 9000 },
        { "Id": 4, "Name": "Volvo", "Price": 29000 },
        { "Id": 5, "Name": "Bentley", "Price": 350000 },
        { "Id": 6, "Name": "Citroen", "Price": 21000 },
        { "Id": 7, "Name": "Hummer", "Price": 41400 },
        { "Id": 8, "Name": "Volkswagen", "Price": 21600 }
]
# Inserindo dados
with eng.connect() as con:
  for line in data:
    con.execute(text("""INSERT INTO Cars(Id, Name, Price) VALUES(:Id, :Name, :Price)"""), **line)

In [27]:
# Recebendo dados
with eng.connect() as con:
  rs = con.execute(text("SELECT * FROM Cars"))
  print(rs.fetchone())
  #print(rs.fetchone())
  #print(rs.fetchmany(2))
  #print(rs.fetchone())
  #print(rs.fetchall())

(1, 'Audi', 52642)
(2, 'Mercedes', 57127)
[(3, 'Skoda', 9000), (4, 'Volvo', 29000)]
(5, 'Bentley', 350000)
[(6, 'Citroen', 21000), (7, 'Hummer', 41400), (8, 'Volkswagen', 21600), (10, 'belina', 1500)]

### SQL Expression Language

#### Definição de Schemas

In [28]:
from sqlalchemy import Table, Column, Integer, String, MetaData

In [29]:
# Cria um ojeto de metadata. Metadatas são coleçoes de tabelas e sua infos
meta = MetaData()

In [30]:
#Cria um objeto do tipo tabela que abstrai uma tabela no Banco de dados
cars = Table('Cars', meta,
     Column('Id', Integer, primary_key=True),
     Column('Name', String),
     Column('Price', Integer)
)

In [33]:
print("The Name column:")
print(cars.columns.Name)
print(cars.c.Name)

#print("Columns: ")
#for col in cars.c:
#    print(col)
    
#print("Primary keys:")
#for pk in cars.primary_key:
#    print(pk)    

print("The Id column:")
print(cars.c.Id.name)
print(cars.c.Id.type)
print(cars.c.Id.nullable)
print(cars.c.Id.primary_key)

The Name column:
Cars.Name
Cars.Name
The Id column:
Id
INTEGER
False
True

In [34]:
#refletir a base de dados
meta.reflect(bind=eng)
for table in meta.tables:
    print(table)

Cars

In [36]:
from sqlalchemy import inspect

In [37]:
insp = inspect(eng)  #olha a eng
print(insp.get_table_names())
print(insp.get_columns("Cars"))
print(insp.get_pk_constraint("Cars"))

['Cars']
[{'name': 'Id', 'type': INTEGER(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 1}, {'name': 'Name', 'type': TEXT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}, {'name': 'Price', 'type': INTEGER(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}]
{'constrained_columns': ['Id'], 'name': None}

In [39]:
meta.create_all(eng) #salvar as tabelas

#### Expression Language

In [38]:
from sqlalchemy.sql import select

In [40]:
with eng.connect() as con:
  stm = cars.insert(values=[(11, 'Escort', 2000)])
  print(stm)
  #stm = cars.insert(values=[(11, 'Escort', 2000)])
  con.execute(stm)

INSERT INTO "Cars" ("Id", "Name", "Price") VALUES (:Id_m0, :Name_m0, :Price_m0)

In [44]:
# SELECT
with eng.connect() as con:
  stm = select([cars.c.Name])
  print(stm)
  #rs = con.execute(stm) 
  #print(rs.fetchall())

SELECT "Cars"."Name"
FROM "Cars"

In [45]:
print(stm)

SELECT "Cars"."Name"
FROM "Cars"

In [46]:
# LIMIT
with eng.connect() as con:
  stm = select([cars.c.Name, cars.c.Price]).limit(3)
  rs = con.execute(stm) 
  print(rs.fetchall())

[('Audi', 52642), ('Mercedes', 57127), ('Skoda', 9000)]

In [47]:
print(stm)

SELECT "Cars"."Name", "Cars"."Price"
FROM "Cars"
 LIMIT :param_1

In [49]:
from sqlalchemy.sql import and_, or_

In [50]:
# WHERE
with eng.connect() as con:
  stm = select([cars]).where(and_(cars.c.Price > 10000, cars.c.Price < 40000))
  rs = con.execute(stm) 
  print(rs.fetchall())

[(4, 'Volvo', 29000), (6, 'Citroen', 21000), (8, 'Volkswagen', 21600)]

In [53]:
print(stm)

SELECT "Cars"."Id", "Cars"."Name", "Cars"."Price"
FROM "Cars"
WHERE "Cars"."Name" LIKE :Name_1

In [54]:
#LIKE
with eng.connect() as con:
  stm = select([cars]).where(cars.c.Name.like('E%'))
  rs = con.execute(stm) 
  print(rs.fetchall())

[(11, 'Escort', 2000)]

In [55]:
from sqlalchemy.sql import asc, desc

In [ ]:
# Order By
with eng.connect() as con:  
  s = select([cars]).order_by(asc(cars.c.Name))
  rs = con.execute(s) 
  for row in rs:
    print(row['Id'], row['Name'], row['Price'])

11 Escort 2000

In [ ]:
# ler dos arquivos
with eng.connect() as con:
  authors = Table('Authors', meta, autoload=True)
  books = Table('Books', meta, autoload=True)
  stm = select([authors.join(books)])
  rs = con.execute(stm) 
  for row in rs:
    print row['Name'], row['Title']

### Object-Relational Mapping (ORM)

In [57]:
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String
from sqlalchemy.orm import sessionmaker
from sqlalchemy.exc import IntegrityError

In [58]:
# Classes Bases e Sessão
Base = declarative_base(bind=eng)
Session = sessionmaker(bind=eng)

In [59]:
class Car(Base):
  __tablename__ = "Cars"

  id = Column('Id', Integer, primary_key=True, autoincrement=True)
  name = Column('Name', String, unique=True, index=True)  
  price = Column('Price', Integer, nullable=False)

  def __repr__(self):
    return f"<Car: {self.name}>"

  def acelera(self):
    print("Vrrrummmm")

In [60]:
Base.metadata.create_all()        
ses = Session()

In [61]:
audi = Car(name='Audi', price=52642)

In [62]:
audi2 = Car(name='Audi', price=2000)

In [65]:
#integracao de validade de erro
try: 
  ses.add(audi2)
  ses.commit()
except IntegrityError:
  print("Ja existe um carro com esse nome")
  ses.rollback()

In [66]:
#retorna o que o metodo faz
audi.name

'Audi'

In [67]:
try:
  with Session() as s:
    s.add_all([ 
      Car(name='Mercedes', price=57127),
      Car(name='Skoda', price=9000),
      Car(name='Volvo', price=29000),
      Car(name='Bentley', price=350000),
      Car(name='Citroen', price=21000),
      Car(name='Hummer', price=41400),
      Car(name='Volkswagen', price=21600)
    ])
    s.commit()
except Exception:
  print("Deu ruim!")

In [68]:
# Fazendo a query
with Session() as s:
  rs = s.query(Car).all()
  for car in rs:
    print(car.name, car.price)

Audi 52642
Mercedes 57127
Skoda 9000
Volvo 29000
Bentley 350000
Citroen 21000
Hummer 41400
Volkswagen 21600
belina 1500
Escort 2000
Audi 2000
Mercedes 57127
Skoda 9000
Volvo 29000
Bentley 350000
Citroen 21000
Hummer 41400
Volkswagen 21600

In [69]:
with Session() as s:
  rs = s.query(Car)
  for car in rs:
    print(car.name, car.price)

Audi 52642
Mercedes 57127
Skoda 9000
Volvo 29000
Bentley 350000
Citroen 21000
Hummer 41400
Volkswagen 21600
belina 1500
Escort 2000
Audi 2000
Mercedes 57127
Skoda 9000
Volvo 29000
Bentley 350000
Citroen 21000
Hummer 41400
Volkswagen 21600

In [70]:
from sqlalchemy import ForeignKey
from sqlalchemy.orm import relationship

In [71]:
class Author(Base):
  __tablename__ = "Authors"
 
  author_id = Column(Integer, primary_key=True, autoincrement=True)
  name = Column(String)  
  books = relationship("Book")

  def __init__(self, name):
    self.name = name

  def __repr__(self):
    return f"<Author: {self.name}>"

class Book(Base):
  __tablename__ = "Books"
 
  book_id = Column(Integer, primary_key=True, autoincrement=True)
  title = Column(String)      
  author_id = Column(Integer, ForeignKey("Authors.author_id"))    
  author = relationship("Author")

  def __init__(self, title, author_id):
    self.title = title
    self.author_id = author_id 

  def __repr__(self):
    return f"<Book: {self.title} - {self.author.name}>"

In [72]:
Base.metadata.create_all()

In [73]:
with Session() as s:
  s.add_all([ 
    Author('Jane Austen'),
    Author('Leo Tolstoy'),
    Author('Joseph Heller'),
    Author('Charles Dickens'),
    Book('Emma',1),
    Book('War and Peace',2),
    Book('Catch XII',3),
    Book('David Copperfield',4),
    Book('Good as Gold',3),
    Book('Anna Karenia',2)
  ])
  s.commit()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: SAWarning: relationship 'Book.author' will copy column Authors.author_id to column Books.author_id, which conflicts with relationship(s): 'Author.books' (copies Authors.author_id to Books.author_id). If this is not the intention, consider if these relationships should be linked with back_populates, or if viewonly=True should be applied to one or more if they are read-only. For the less common case that foreign key constraints are partially overlapping, the orm.foreign() annotation can be used to isolate the columns that should be written towards.   To silence this warning, add the parameter 'overlaps="books"' to the 'Book.author' relationship.
  This is separate from the ipykernel package so we can avoid doing imports until

In [74]:
with Session() as s:
  res = s.query(Author).all()
  print(res)

[<Author: Jane Austen>, <Author: Leo Tolstoy>, <Author: Joseph Heller>, <Author: Charles Dickens>]

In [75]:
with Session() as s:
  res = s.query(Book).all()
  print(res)

[<Book: Emma - Jane Austen>, <Book: War and Peace - Leo Tolstoy>, <Book: Catch XII - Joseph Heller>, <Book: David Copperfield - Charles Dickens>, <Book: Good as Gold - Joseph Heller>, <Book: Anna Karenia - Leo Tolstoy>]

In [76]:
with Session() as s:
  res = s.query(Author).filter(Author.name=="Leo Tolstoy").first()
  print(res.name)
  for book in res.books:
    print (book.title)

Leo Tolstoy
War and Peace
Anna Karenia

In [77]:
with Session() as s:
  res = s.query(Book).filter(Book.title=="Emma").first()
  print(res.author.name)

Jane Austen